[
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSVJXdFFSRUZ4Y2xOWk5tcDVaRTkzZGxkblgwRRAB",
    "author_name": "Mr Manders",
    "author_url": "https://www.google.com/maps/contrib/108296664847784626441/reviews?hl=en",
    "rating": 5,
    "date_formatted": "19/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Nice experience with an even better taste. Some seem to disagree but I couldn't see why. Press the button on your table and the staff is there within seconds to help you with anything you'd need. The chicken sate came with one of the best sauce I have ever tasted. The pork egg rolls were yummy and the Kao Soy was spicy and delicious. The drinks are good too, definitely worth a try!",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMWQxbHdTRVpQTkZCa1VtaGZTbVpITnpsNlduYxAB",
    "author_name": "Andrew V",
    "author_url": "https://www.google.com/maps/contrib/106025776551110021136/reviews?hl=en",
    "rating": 5,
    "date_formatted": "26/10/2025",
    "date_relative": "2 weeks ago",
    "review_text": "This isn't my first time here at Kao Soy Nimman but it is my first time dropping the review. I've tried Kao soy from so many places around Chiang Mai, but honestly, Kao Soy Nimman is the best one yet. I get why it’s so famous...and now I 100% agree with all the hype 👍 The broth is rich, creamy, not too thick or liquidly and it's full of flavor, the noodles are perfectly cooked, and that crispy topping adds the perfect crunch. Everything just comes together so well. **Don't underestimate their chilli** Even though it’s already super popular with both locals and tourists, it really deserves the extra fame. If you’re in Chiang Mai and want to taste the best Kao Soy OR Khao Soi, this is the spot. Totally recommend! 👍",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Vk4zaHZkbVZaVTFkNk1reHNMVFJoZERBdFpIYxAB",
    "author_name": "Luana Bedin",
    "author_url": "https://www.google.com/maps/contrib/110803425534899526367/reviews?hl=en",
    "rating": 4,
    "date_formatted": "04/11/2025",
    "date_relative": "6 days ago",
    "review_text": "It's a very famous restaurant in the area, known for the dish that gives the place its name. Because of its fame, it's almost always crowded, so it's common to find a small queue at the entrance.Luckily, the line moved quickly, and we didn't wait long to be seated. The service was good and attentive. We tried the famous Khao Soi: it was tasty, and the ingredients seemed high-quality, but honestly, it wasn't excellent. Given the restaurant's reputation, I was expecting a bit more. It's good, but not the best I've had. They accept card payments.",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SelJuRXdVMEpVYTFKVU1ubFVRMlp5VlVaSlNGRRAB",
    "author_name": "Tates Napawan (Tates)",
    "author_url": "https://www.google.com/maps/contrib/104051659724326102869/reviews?hl=en",
    "rating": 5,
    "date_formatted": "18/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Tried the Khao Soi Chicken and the Chicken Satay Peanut Sauce Noodle both were amazing. The Khao Soi had rich standard coconut curry broth, crispy noodles on top, and super tender chicken. The balance of spice, creaminess, and a squeeze of lime was just perfect. The Satay Peanut Noodles were such a nice surprise!!!! creamy, nutty, slightly sweet, with grilled chicken that had that smoky flavor 9/10. A great fusion of comfort food and Thai street style. Nice cozy spot with warm Chiang Mai vibes. Perfect for anyone who loves flavorful northern Thai food. Highly recommend adding this place to your food list when you’re in town! Food looks as good as it tastes check the photos that I took here.",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa2MxZ3RXV0pUTFZKblVrbFVZek0yZVhKNFZsRRAB",
    "author_name": "Eric Shao",
    "author_url": "https://www.google.com/maps/contrib/118345644082188813951/reviews?hl=en",
    "rating": 3,
    "date_formatted": "05/11/2025",
    "date_relative": "5 days ago",
    "review_text": "I had Oder Chicken Satay,Ong Pu(Crab) , Beef KHAO Soi , Iced Dessert . Actually, I think the KHAO SoI weren't as good as I expected; everyone has their own preferences. I am more like to eat that noodle I’m tried at Chiang Rai. KHAO Soi 4 Stars Iced Dessert 5 Stars!!!! Chicken Satay 3 Stars Ong Pu 1 Stars (This is not something I would eat.) Staff Service Good & Helpful",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V2RVRjJkVXg0TWsxek1rMUlNVGhZY2xwck9WRRAB",
    "author_name": "Adeline Ng",
    "author_url": "https://www.google.com/maps/contrib/107283999270766591412/reviews?hl=en",
    "rating": 5,
    "date_formatted": "28/09/2025",
    "date_relative": "a month ago",
    "review_text": "The KaoSoi (Chiang Mai curry-like noodle ) here is one notch higher and premium quality and more varieties with other stir fried dishes which are equally good. It’s more like a restaurant rather than a noodle bistro. The food are pretty good and yummy, I gave it almost 10pts . A bit on a touristy and pricey side but is worth it. Nicely decorated, clean and staffs able to speak English.",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscmFUVXpXbU13TW1sWFgzb3hRMEpmYlV0aVNrRRAB",
    "author_name": "MonZterella Lee",
    "author_url": "https://www.google.com/maps/contrib/113445967644793914496/reviews?hl=en",
    "rating": 4,
    "date_formatted": "01/11/2025",
    "date_relative": "a week ago",
    "review_text": "Had to try Khao Soi Nimman because our driver recommended it—and it’s super close to our hotel! If you come to Northern Thailand and don’t try Khao Soi, it’s like you didn’t really make it here. We went for chicken Khao Soi, braised beef Khao Soi, stir-fried pumpkin leaves with oyster sauce, crispy ruby dessert in coconut milk, and fresh coconut water. Absolute must-try!",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTlFuWjJaREJhUlhkQ1VHUnRWRGh2Ym14RFMxRRAB",
    "author_name": "Masaaki S",
    "author_url": "https://www.google.com/maps/contrib/105525919671933456837/reviews?hl=en",
    "rating": 5,
    "date_formatted": "30/08/2025",
    "date_relative": "2 months ago",
    "review_text": "The best Kao Soy I’ve ever had. The spiciness of the soup was perfectly balanced—neither overpowering nor too mild. Its consistency struck the right note as well, being neither too thick nor too watery. The two types of noodles, one firm and the other soft, added depth and variety to each bite. Midway through, the topping of lemon slices, onions, and pickled vegetables refreshed the flavor, making the bowl enjoyable from start to finish. Although about ten people were waiting outside, our turn came in just around 20 minutes.",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toYVNscFpOR2xhY1drMFdFNW5ha2t0TWxZd1YxRRAB",
    "author_name": "peteryuchen",
    "author_url": "https://www.google.com/maps/contrib/111345023743504920382/reviews?hl=en",
    "rating": 4,
    "date_formatted": "17/09/2025",
    "date_relative": "a month ago",
    "review_text": "A nice variety of curry noodles, with flavors that are rich and satisfying; although a little on the salty side after finishing the meal. A must-try here is the Thai-style omelet, very juicy, flavorful, and generously filled with pork! Indoor air-conditioned seating is limited, so it can be a bit hard to get a comfortable spot during busy hours. Overall, it’s a good place to experience authentic local curry noodles in Chiang Mai.",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdVJVMVpNV2RmYjA0MGRVSlJNMFJvZFVkSlpuYxAB",
    "author_name": "Jeffrey Ness2021",
    "author_url": "https://www.google.com/maps/contrib/116407532466842251410/reviews?hl=en",
    "rating": 5,
    "date_formatted": "31/08/2025",
    "date_relative": "2 months ago",
    "review_text": "This restaurant deserves to get its first Michelin star! All the products were not only very tasty, but the products also contained a unique blend of Norhern Thai-style flavors (which are in my opinion the better dishes of Thailand). We felt really treated like kings. The service was impeccable and no waiting thanks to the digital bell on our dining table. As a starter, we ate the soft, creamy and scrumptious eggplant salad, which I can really recommend to vegetarians. Also the chicken skewers with satay sauce was a great addition to our order, with a wink to the original chicken-satay skewers from Indonesia. Even the pickled veggies let me think of the Indonesian dishes for a while. However, I have to confess that I personally prefer an Indonesian-style satay sauce. For our main course we had a great stir-fried chicken dish with a great combination of spices. To add more spice to our dinner, we had the delicious Kang Nor curry dish. I really like this curry for the added bamboo sprouts and dried fish. As a non-pork eater, I obviously chose this fish-variety. However, they also have a pork-variety. My boyfriend and I were seated inside. The restaurant was well climatized and very clean. You could even look through the glass, where you could see the diligent people working hard to make exquisite dishes. Even the dining tables were of another kind of level. At the end of our dinner we realized that we had been sitting on a ‘remade’ authentic sewing table. It gives the restaurant so much more atmosphere. As a dessert, I ate colored soft noodles in sweet coconut milk. I must say that this type of dessert, has it all to me. We went to our hotel totally satisfied, joyful and fully fed. I can assure everyone that you will enjoy your meal here to the highest level!",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTWQxbFNSemgwVEVsb2FGRXROUzFzVTJSYWVVRRAB",
    "author_name": "Alexia Wu",
    "author_url": "https://www.google.com/maps/contrib/115920220522093664289/reviews?hl=en",
    "rating": 5,
    "date_formatted": "28/10/2025",
    "date_relative": "a week ago",
    "review_text": "Best satay chicken and dessert in town. We also ordered 2 koh soi and were really tasty. The place can get a bit crowded cuz apparently it is a highly recommended place. So be prepared to wait a bit if you come for dinner. But definitely worth visiting!",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUFNtSnJWV2hRTlVNNWJIQm9abTVrZVVOM1JWRRAB",
    "author_name": "Fabien G.",
    "author_url": "https://www.google.com/maps/contrib/103950402934750199113/reviews?hl=en",
    "rating": 1,
    "date_formatted": "20/07/2025",
    "date_relative": "3 months ago",
    "review_text": "What can I say... I think there is a management problem in this restaurant. After being seated, we had to call someone after 15 minutes because no one seemed to want to take our order. No hello. The staff waits for orders with their arms behind their backs against trees or walls. We chose to try the kao soy because we know it well. What a surprise when the dish arrived, we would have said half a portion with say 5 tablespoons of sauce maximum. Also, we decided to try a dessert. Likewise, no one came to ask us if we wanted something... yet many staff were available and we had to call them. And as you can see from the pictures, no one cleared the meal / table before and during dessert. There are other places much better in terms of taste, service and price in Chang Mai.",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5U1NtVnliWGxzZEZWQlF6VklXalExY1VVNFdGRRAB",
    "author_name": "Marcus Nguyen",
    "author_url": "https://www.google.com/maps/contrib/101665156824263661087/reviews?hl=en",
    "rating": 5,
    "date_formatted": "15/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Must eat for anyone wanting to taste authentic northern Thai cuisines. Their Khao soy is rich and creamy, perfectly balanced between coconut milk and spices. Definitely a go to spots for Khao soy lovers in Chiang Mai.",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNlRWVlBOQzFYV1VsSk1FRjNXbVZLYlhkQ2MzYxAB",
    "author_name": "Burcu Güvenatam",
    "author_url": "https://www.google.com/maps/contrib/109426111080051673835/reviews?hl=en",
    "rating": 5,
    "date_formatted": "25/09/2025",
    "date_relative": "a month ago",
    "review_text": "We loved the food! Kao soy with beef was sooo delicious! l loved the aubergine salad and chicken satay was also good with its sauces. Service is very quick also… Lovely place!",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcGNFUldNVWcxVVVKaFRGbFdlbXA0YW5oTVJYYxAB",
    "author_name": "Frank van den Brink",
    "author_url": "https://www.google.com/maps/contrib/109196633285157297039/reviews?hl=en",
    "rating": 5,
    "date_formatted": "22/06/2025",
    "date_relative": "4 months ago",
    "review_text": "Great place for gourmet noodles. Off course a hype because it is Michelin recommended, but the dishes are really good and very moderate priced. The staff seems to be less happy with all the attention and refrain from any smile...",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVmJtcEpNRU00TjJ0bFdVbERUWGc0WW5KTldIYxAB",
    "author_name": "vickie w",
    "author_url": "https://www.google.com/maps/contrib/105524925208508571693/reviews?hl=en",
    "rating": 2,
    "date_formatted": "05/11/2025",
    "date_relative": "4 days ago",
    "review_text": "Tourist trap with inflated prices and bland food. We ordered three different khao sois and a variety of sides and the noodles were overcooked and the food was lukewarm. Also because of the outdoor location and standing water, the restaurant is a breeding ground for mosquitoes that will attack you relentlessly 😭",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNFRUaEtXVmhJZGxJeU9FSTNOR2d0ZVZaSmNrRRAB",
    "author_name": "Sonny",
    "author_url": "https://www.google.com/maps/contrib/107436983641780303813/reviews?hl=en",
    "rating": 5,
    "date_formatted": "09/06/2025",
    "date_relative": "5 months ago",
    "review_text": "Absolutely delicious kao soi! I have tried some other places before but they were so spicy. This place could make \"less spicy\" for me and it was heavenly. I finished the meal in 10 min. Very tender braised beef. Flavorful soup. Crispy and soft noodles. I will come back to here anytime I get to visit Chiang Mai again. It's that good.",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVkxUaFpVakpLWm5Cc1FVWklORE53YW14ZlRtYxAB",
    "author_name": "Tang-Fei Chang",
    "author_url": "https://www.google.com/maps/contrib/114657543380005456650/reviews?hl=en",
    "rating": 4,
    "date_formatted": "20/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Almost every tourist comes here to eat. The prices are a bit higher than other Northern Thai places. The decor and vibe are really nice. The Khao Soi is pretty spicy, and the other dishes are quite strong in flavor too. Worth a try if you’re around, but if there’s a long line, you can skip it.",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUVNFMVVVR0pFVjFGeE5FdExSbUpmTURGVVJuYxAB",
    "author_name": "Jason",
    "author_url": "https://www.google.com/maps/contrib/111872116513476028322/reviews?hl=en",
    "rating": 4,
    "date_formatted": "26/06/2025",
    "date_relative": "4 months ago",
    "review_text": "1350 for 3 different Kao soy, 2 mixed platters and calamari. Everything was nice enough except the calamari. Kao soy was like a Malaysian curry mee (not laksa) with a thicker and plainer broth. The noodles and crunch is nice though. The silkworms were nice and crispy with a bit of salt flavour. Northern Thai sausage platter was average in textures and taste but the dips made up for it. The chicken satay was nice enough but nothing special. The black rice is like a Bak chang so not a fan. Pork floss and onion ring were quite nice. Pork rind was normal. Calamari batter was not sticking and while crispy lacked flavour. Service was a bit slow when getting the bill. Had to ask 3 different people before we got the bill.",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNGNFZFJhVmRGWXpCTkxWTmpWVXB6ZEhGNVpuYxAB",
    "author_name": "Lam Mai",
    "author_url": "https://www.google.com/maps/contrib/105303743975265590045/reviews?hl=en",
    "rating": 5,
    "date_formatted": "06/08/2025",
    "date_relative": "3 months ago",
    "review_text": "Food: 10/10 Atmosphere: 8/10 The best noodle you can find in Chiang Mai. Amazing side dishes too. The restaurant is big, but always crowded so you may have to wait for tables. But it’s totally worth it in my opinion.",
    "page_number": 1,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSVJXdFFSRUZ4Y2xOWk5tcDVaRTkzZGxkblgwRRAB",
    "author_name": "Mr Manders",
    "author_url": "https://www.google.com/maps/contrib/108296664847784626441/reviews?hl=en",
    "rating": 5,
    "date_formatted": "19/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Nice experience with an even better taste. Some seem to disagree but I couldn't see why. Press the button on your table and the staff is there within seconds to help you with anything you'd need. The chicken sate came with one of the best sauce I have ever tasted. The pork egg rolls were yummy and the Kao Soy was spicy and delicious. The drinks are good too, definitely worth a try!",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMWQxbHdTRVpQTkZCa1VtaGZTbVpITnpsNlduYxAB",
    "author_name": "Andrew V",
    "author_url": "https://www.google.com/maps/contrib/106025776551110021136/reviews?hl=en",
    "rating": 5,
    "date_formatted": "26/10/2025",
    "date_relative": "2 weeks ago",
    "review_text": "This isn't my first time here at Kao Soy Nimman but it is my first time dropping the review. I've tried Kao soy from so many places around Chiang Mai, but honestly, Kao Soy Nimman is the best one yet. I get why it’s so famous...and now I 100% agree with all the hype 👍 The broth is rich, creamy, not too thick or liquidly and it's full of flavor, the noodles are perfectly cooked, and that crispy topping adds the perfect crunch. Everything just comes together so well. **Don't underestimate their chilli** Even though it’s already super popular with both locals and tourists, it really deserves the extra fame. If you’re in Chiang Mai and want to taste the best Kao Soy OR Khao Soi, this is the spot. Totally recommend! 👍",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Vk4zaHZkbVZaVTFkNk1reHNMVFJoZERBdFpIYxAB",
    "author_name": "Luana Bedin",
    "author_url": "https://www.google.com/maps/contrib/110803425534899526367/reviews?hl=en",
    "rating": 4,
    "date_formatted": "04/11/2025",
    "date_relative": "6 days ago",
    "review_text": "It's a very famous restaurant in the area, known for the dish that gives the place its name. Because of its fame, it's almost always crowded, so it's common to find a small queue at the entrance.Luckily, the line moved quickly, and we didn't wait long to be seated. The service was good and attentive. We tried the famous Khao Soi: it was tasty, and the ingredients seemed high-quality, but honestly, it wasn't excellent. Given the restaurant's reputation, I was expecting a bit more. It's good, but not the best I've had. They accept card payments.",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SelJuRXdVMEpVYTFKVU1ubFVRMlp5VlVaSlNGRRAB",
    "author_name": "Tates Napawan (Tates)",
    "author_url": "https://www.google.com/maps/contrib/104051659724326102869/reviews?hl=en",
    "rating": 5,
    "date_formatted": "18/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Tried the Khao Soi Chicken and the Chicken Satay Peanut Sauce Noodle both were amazing. The Khao Soi had rich standard coconut curry broth, crispy noodles on top, and super tender chicken. The balance of spice, creaminess, and a squeeze of lime was just perfect. The Satay Peanut Noodles were such a nice surprise!!!! creamy, nutty, slightly sweet, with grilled chicken that had that smoky flavor 9/10. A great fusion of comfort food and Thai street style. Nice cozy spot with warm Chiang Mai vibes. Perfect for anyone who loves flavorful northern Thai food. Highly recommend adding this place to your food list when you’re in town! Food looks as good as it tastes check the photos that I took here.",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa2MxZ3RXV0pUTFZKblVrbFVZek0yZVhKNFZsRRAB",
    "author_name": "Eric Shao",
    "author_url": "https://www.google.com/maps/contrib/118345644082188813951/reviews?hl=en",
    "rating": 3,
    "date_formatted": "05/11/2025",
    "date_relative": "5 days ago",
    "review_text": "I had Oder Chicken Satay,Ong Pu(Crab) , Beef KHAO Soi , Iced Dessert . Actually, I think the KHAO SoI weren't as good as I expected; everyone has their own preferences. I am more like to eat that noodle I’m tried at Chiang Rai. KHAO Soi 4 Stars Iced Dessert 5 Stars!!!! Chicken Satay 3 Stars Ong Pu 1 Stars (This is not something I would eat.) Staff Service Good & Helpful",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V2RVRjJkVXg0TWsxek1rMUlNVGhZY2xwck9WRRAB",
    "author_name": "Adeline Ng",
    "author_url": "https://www.google.com/maps/contrib/107283999270766591412/reviews?hl=en",
    "rating": 5,
    "date_formatted": "28/09/2025",
    "date_relative": "a month ago",
    "review_text": "The KaoSoi (Chiang Mai curry-like noodle ) here is one notch higher and premium quality and more varieties with other stir fried dishes which are equally good. It’s more like a restaurant rather than a noodle bistro. The food are pretty good and yummy, I gave it almost 10pts . A bit on a touristy and pricey side but is worth it. Nicely decorated, clean and staffs able to speak English.",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscmFUVXpXbU13TW1sWFgzb3hRMEpmYlV0aVNrRRAB",
    "author_name": "MonZterella Lee",
    "author_url": "https://www.google.com/maps/contrib/113445967644793914496/reviews?hl=en",
    "rating": 4,
    "date_formatted": "01/11/2025",
    "date_relative": "a week ago",
    "review_text": "Had to try Khao Soi Nimman because our driver recommended it—and it’s super close to our hotel! If you come to Northern Thailand and don’t try Khao Soi, it’s like you didn’t really make it here. We went for chicken Khao Soi, braised beef Khao Soi, stir-fried pumpkin leaves with oyster sauce, crispy ruby dessert in coconut milk, and fresh coconut water. Absolute must-try!",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTlFuWjJaREJhUlhkQ1VHUnRWRGh2Ym14RFMxRRAB",
    "author_name": "Masaaki S",
    "author_url": "https://www.google.com/maps/contrib/105525919671933456837/reviews?hl=en",
    "rating": 5,
    "date_formatted": "30/08/2025",
    "date_relative": "2 months ago",
    "review_text": "The best Kao Soy I’ve ever had. The spiciness of the soup was perfectly balanced—neither overpowering nor too mild. Its consistency struck the right note as well, being neither too thick nor too watery. The two types of noodles, one firm and the other soft, added depth and variety to each bite. Midway through, the topping of lemon slices, onions, and pickled vegetables refreshed the flavor, making the bowl enjoyable from start to finish. Although about ten people were waiting outside, our turn came in just around 20 minutes.",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toYVNscFpOR2xhY1drMFdFNW5ha2t0TWxZd1YxRRAB",
    "author_name": "peteryuchen",
    "author_url": "https://www.google.com/maps/contrib/111345023743504920382/reviews?hl=en",
    "rating": 4,
    "date_formatted": "17/09/2025",
    "date_relative": "a month ago",
    "review_text": "A nice variety of curry noodles, with flavors that are rich and satisfying; although a little on the salty side after finishing the meal. A must-try here is the Thai-style omelet, very juicy, flavorful, and generously filled with pork! Indoor air-conditioned seating is limited, so it can be a bit hard to get a comfortable spot during busy hours. Overall, it’s a good place to experience authentic local curry noodles in Chiang Mai.",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdVJVMVpNV2RmYjA0MGRVSlJNMFJvZFVkSlpuYxAB",
    "author_name": "Jeffrey Ness2021",
    "author_url": "https://www.google.com/maps/contrib/116407532466842251410/reviews?hl=en",
    "rating": 5,
    "date_formatted": "31/08/2025",
    "date_relative": "2 months ago",
    "review_text": "This restaurant deserves to get its first Michelin star! All the products were not only very tasty, but the products also contained a unique blend of Norhern Thai-style flavors (which are in my opinion the better dishes of Thailand). We felt really treated like kings. The service was impeccable and no waiting thanks to the digital bell on our dining table. As a starter, we ate the soft, creamy and scrumptious eggplant salad, which I can really recommend to vegetarians. Also the chicken skewers with satay sauce was a great addition to our order, with a wink to the original chicken-satay skewers from Indonesia. Even the pickled veggies let me think of the Indonesian dishes for a while. However, I have to confess that I personally prefer an Indonesian-style satay sauce. For our main course we had a great stir-fried chicken dish with a great combination of spices. To add more spice to our dinner, we had the delicious Kang Nor curry dish. I really like this curry for the added bamboo sprouts and dried fish. As a non-pork eater, I obviously chose this fish-variety. However, they also have a pork-variety. My boyfriend and I were seated inside. The restaurant was well climatized and very clean. You could even look through the glass, where you could see the diligent people working hard to make exquisite dishes. Even the dining tables were of another kind of level. At the end of our dinner we realized that we had been sitting on a ‘remade’ authentic sewing table. It gives the restaurant so much more atmosphere. As a dessert, I ate colored soft noodles in sweet coconut milk. I must say that this type of dessert, has it all to me. We went to our hotel totally satisfied, joyful and fully fed. I can assure everyone that you will enjoy your meal here to the highest level!",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTWQxbFNSemgwVEVsb2FGRXROUzFzVTJSYWVVRRAB",
    "author_name": "Alexia Wu",
    "author_url": "https://www.google.com/maps/contrib/115920220522093664289/reviews?hl=en",
    "rating": 5,
    "date_formatted": "28/10/2025",
    "date_relative": "a week ago",
    "review_text": "Best satay chicken and dessert in town. We also ordered 2 koh soi and were really tasty. The place can get a bit crowded cuz apparently it is a highly recommended place. So be prepared to wait a bit if you come for dinner. But definitely worth visiting!",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUFNtSnJWV2hRTlVNNWJIQm9abTVrZVVOM1JWRRAB",
    "author_name": "Fabien G.",
    "author_url": "https://www.google.com/maps/contrib/103950402934750199113/reviews?hl=en",
    "rating": 1,
    "date_formatted": "20/07/2025",
    "date_relative": "3 months ago",
    "review_text": "What can I say... I think there is a management problem in this restaurant. After being seated, we had to call someone after 15 minutes because no one seemed to want to take our order. No hello. The staff waits for orders with their arms behind their backs against trees or walls. We chose to try the kao soy because we know it well. What a surprise when the dish arrived, we would have said half a portion with say 5 tablespoons of sauce maximum. Also, we decided to try a dessert. Likewise, no one came to ask us if we wanted something... yet many staff were available and we had to call them. And as you can see from the pictures, no one cleared the meal / table before and during dessert. There are other places much better in terms of taste, service and price in Chang Mai.",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5U1NtVnliWGxzZEZWQlF6VklXalExY1VVNFdGRRAB",
    "author_name": "Marcus Nguyen",
    "author_url": "https://www.google.com/maps/contrib/101665156824263661087/reviews?hl=en",
    "rating": 5,
    "date_formatted": "15/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Must eat for anyone wanting to taste authentic northern Thai cuisines. Their Khao soy is rich and creamy, perfectly balanced between coconut milk and spices. Definitely a go to spots for Khao soy lovers in Chiang Mai.",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNlRWVlBOQzFYV1VsSk1FRjNXbVZLYlhkQ2MzYxAB",
    "author_name": "Burcu Güvenatam",
    "author_url": "https://www.google.com/maps/contrib/109426111080051673835/reviews?hl=en",
    "rating": 5,
    "date_formatted": "25/09/2025",
    "date_relative": "a month ago",
    "review_text": "We loved the food! Kao soy with beef was sooo delicious! l loved the aubergine salad and chicken satay was also good with its sauces. Service is very quick also… Lovely place!",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcGNFUldNVWcxVVVKaFRGbFdlbXA0YW5oTVJYYxAB",
    "author_name": "Frank van den Brink",
    "author_url": "https://www.google.com/maps/contrib/109196633285157297039/reviews?hl=en",
    "rating": 5,
    "date_formatted": "22/06/2025",
    "date_relative": "4 months ago",
    "review_text": "Great place for gourmet noodles. Off course a hype because it is Michelin recommended, but the dishes are really good and very moderate priced. The staff seems to be less happy with all the attention and refrain from any smile...",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVmJtcEpNRU00TjJ0bFdVbERUWGc0WW5KTldIYxAB",
    "author_name": "vickie w",
    "author_url": "https://www.google.com/maps/contrib/105524925208508571693/reviews?hl=en",
    "rating": 2,
    "date_formatted": "05/11/2025",
    "date_relative": "4 days ago",
    "review_text": "Tourist trap with inflated prices and bland food. We ordered three different khao sois and a variety of sides and the noodles were overcooked and the food was lukewarm. Also because of the outdoor location and standing water, the restaurant is a breeding ground for mosquitoes that will attack you relentlessly 😭",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNFRUaEtXVmhJZGxJeU9FSTNOR2d0ZVZaSmNrRRAB",
    "author_name": "Sonny",
    "author_url": "https://www.google.com/maps/contrib/107436983641780303813/reviews?hl=en",
    "rating": 5,
    "date_formatted": "09/06/2025",
    "date_relative": "5 months ago",
    "review_text": "Absolutely delicious kao soi! I have tried some other places before but they were so spicy. This place could make \"less spicy\" for me and it was heavenly. I finished the meal in 10 min. Very tender braised beef. Flavorful soup. Crispy and soft noodles. I will come back to here anytime I get to visit Chiang Mai again. It's that good.",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVkxUaFpVakpLWm5Cc1FVWklORE53YW14ZlRtYxAB",
    "author_name": "Tang-Fei Chang",
    "author_url": "https://www.google.com/maps/contrib/114657543380005456650/reviews?hl=en",
    "rating": 4,
    "date_formatted": "20/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Almost every tourist comes here to eat. The prices are a bit higher than other Northern Thai places. The decor and vibe are really nice. The Khao Soi is pretty spicy, and the other dishes are quite strong in flavor too. Worth a try if you’re around, but if there’s a long line, you can skip it.",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUVNFMVVVR0pFVjFGeE5FdExSbUpmTURGVVJuYxAB",
    "author_name": "Jason",
    "author_url": "https://www.google.com/maps/contrib/111872116513476028322/reviews?hl=en",
    "rating": 4,
    "date_formatted": "26/06/2025",
    "date_relative": "4 months ago",
    "review_text": "1350 for 3 different Kao soy, 2 mixed platters and calamari. Everything was nice enough except the calamari. Kao soy was like a Malaysian curry mee (not laksa) with a thicker and plainer broth. The noodles and crunch is nice though. The silkworms were nice and crispy with a bit of salt flavour. Northern Thai sausage platter was average in textures and taste but the dips made up for it. The chicken satay was nice enough but nothing special. The black rice is like a Bak chang so not a fan. Pork floss and onion ring were quite nice. Pork rind was normal. Calamari batter was not sticking and while crispy lacked flavour. Service was a bit slow when getting the bill. Had to ask 3 different people before we got the bill.",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNGNFZFJhVmRGWXpCTkxWTmpWVXB6ZEhGNVpuYxAB",
    "author_name": "Lam Mai",
    "author_url": "https://www.google.com/maps/contrib/105303743975265590045/reviews?hl=en",
    "rating": 5,
    "date_formatted": "06/08/2025",
    "date_relative": "3 months ago",
    "review_text": "Food: 10/10 Atmosphere: 8/10 The best noodle you can find in Chiang Mai. Amazing side dishes too. The restaurant is big, but always crowded so you may have to wait for tables. But it’s totally worth it in my opinion.",
    "page_number": 2,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSVJXdFFSRUZ4Y2xOWk5tcDVaRTkzZGxkblgwRRAB",
    "author_name": "Mr Manders",
    "author_url": "https://www.google.com/maps/contrib/108296664847784626441/reviews?hl=en",
    "rating": 5,
    "date_formatted": "19/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Nice experience with an even better taste. Some seem to disagree but I couldn't see why. Press the button on your table and the staff is there within seconds to help you with anything you'd need. The chicken sate came with one of the best sauce I have ever tasted. The pork egg rolls were yummy and the Kao Soy was spicy and delicious. The drinks are good too, definitely worth a try!",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMWQxbHdTRVpQTkZCa1VtaGZTbVpITnpsNlduYxAB",
    "author_name": "Andrew V",
    "author_url": "https://www.google.com/maps/contrib/106025776551110021136/reviews?hl=en",
    "rating": 5,
    "date_formatted": "26/10/2025",
    "date_relative": "2 weeks ago",
    "review_text": "This isn't my first time here at Kao Soy Nimman but it is my first time dropping the review. I've tried Kao soy from so many places around Chiang Mai, but honestly, Kao Soy Nimman is the best one yet. I get why it’s so famous...and now I 100% agree with all the hype 👍 The broth is rich, creamy, not too thick or liquidly and it's full of flavor, the noodles are perfectly cooked, and that crispy topping adds the perfect crunch. Everything just comes together so well. **Don't underestimate their chilli** Even though it’s already super popular with both locals and tourists, it really deserves the extra fame. If you’re in Chiang Mai and want to taste the best Kao Soy OR Khao Soi, this is the spot. Totally recommend! 👍",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Vk4zaHZkbVZaVTFkNk1reHNMVFJoZERBdFpIYxAB",
    "author_name": "Luana Bedin",
    "author_url": "https://www.google.com/maps/contrib/110803425534899526367/reviews?hl=en",
    "rating": 4,
    "date_formatted": "04/11/2025",
    "date_relative": "6 days ago",
    "review_text": "It's a very famous restaurant in the area, known for the dish that gives the place its name. Because of its fame, it's almost always crowded, so it's common to find a small queue at the entrance.Luckily, the line moved quickly, and we didn't wait long to be seated. The service was good and attentive. We tried the famous Khao Soi: it was tasty, and the ingredients seemed high-quality, but honestly, it wasn't excellent. Given the restaurant's reputation, I was expecting a bit more. It's good, but not the best I've had. They accept card payments.",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SelJuRXdVMEpVYTFKVU1ubFVRMlp5VlVaSlNGRRAB",
    "author_name": "Tates Napawan (Tates)",
    "author_url": "https://www.google.com/maps/contrib/104051659724326102869/reviews?hl=en",
    "rating": 5,
    "date_formatted": "18/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Tried the Khao Soi Chicken and the Chicken Satay Peanut Sauce Noodle both were amazing. The Khao Soi had rich standard coconut curry broth, crispy noodles on top, and super tender chicken. The balance of spice, creaminess, and a squeeze of lime was just perfect. The Satay Peanut Noodles were such a nice surprise!!!! creamy, nutty, slightly sweet, with grilled chicken that had that smoky flavor 9/10. A great fusion of comfort food and Thai street style. Nice cozy spot with warm Chiang Mai vibes. Perfect for anyone who loves flavorful northern Thai food. Highly recommend adding this place to your food list when you’re in town! Food looks as good as it tastes check the photos that I took here.",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa2MxZ3RXV0pUTFZKblVrbFVZek0yZVhKNFZsRRAB",
    "author_name": "Eric Shao",
    "author_url": "https://www.google.com/maps/contrib/118345644082188813951/reviews?hl=en",
    "rating": 3,
    "date_formatted": "05/11/2025",
    "date_relative": "5 days ago",
    "review_text": "I had Oder Chicken Satay,Ong Pu(Crab) , Beef KHAO Soi , Iced Dessert . Actually, I think the KHAO SoI weren't as good as I expected; everyone has their own preferences. I am more like to eat that noodle I’m tried at Chiang Rai. KHAO Soi 4 Stars Iced Dessert 5 Stars!!!! Chicken Satay 3 Stars Ong Pu 1 Stars (This is not something I would eat.) Staff Service Good & Helpful",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V2RVRjJkVXg0TWsxek1rMUlNVGhZY2xwck9WRRAB",
    "author_name": "Adeline Ng",
    "author_url": "https://www.google.com/maps/contrib/107283999270766591412/reviews?hl=en",
    "rating": 5,
    "date_formatted": "28/09/2025",
    "date_relative": "a month ago",
    "review_text": "The KaoSoi (Chiang Mai curry-like noodle ) here is one notch higher and premium quality and more varieties with other stir fried dishes which are equally good. It’s more like a restaurant rather than a noodle bistro. The food are pretty good and yummy, I gave it almost 10pts . A bit on a touristy and pricey side but is worth it. Nicely decorated, clean and staffs able to speak English.",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscmFUVXpXbU13TW1sWFgzb3hRMEpmYlV0aVNrRRAB",
    "author_name": "MonZterella Lee",
    "author_url": "https://www.google.com/maps/contrib/113445967644793914496/reviews?hl=en",
    "rating": 4,
    "date_formatted": "01/11/2025",
    "date_relative": "a week ago",
    "review_text": "Had to try Khao Soi Nimman because our driver recommended it—and it’s super close to our hotel! If you come to Northern Thailand and don’t try Khao Soi, it’s like you didn’t really make it here. We went for chicken Khao Soi, braised beef Khao Soi, stir-fried pumpkin leaves with oyster sauce, crispy ruby dessert in coconut milk, and fresh coconut water. Absolute must-try!",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTlFuWjJaREJhUlhkQ1VHUnRWRGh2Ym14RFMxRRAB",
    "author_name": "Masaaki S",
    "author_url": "https://www.google.com/maps/contrib/105525919671933456837/reviews?hl=en",
    "rating": 5,
    "date_formatted": "30/08/2025",
    "date_relative": "2 months ago",
    "review_text": "The best Kao Soy I’ve ever had. The spiciness of the soup was perfectly balanced—neither overpowering nor too mild. Its consistency struck the right note as well, being neither too thick nor too watery. The two types of noodles, one firm and the other soft, added depth and variety to each bite. Midway through, the topping of lemon slices, onions, and pickled vegetables refreshed the flavor, making the bowl enjoyable from start to finish. Although about ten people were waiting outside, our turn came in just around 20 minutes.",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toYVNscFpOR2xhY1drMFdFNW5ha2t0TWxZd1YxRRAB",
    "author_name": "peteryuchen",
    "author_url": "https://www.google.com/maps/contrib/111345023743504920382/reviews?hl=en",
    "rating": 4,
    "date_formatted": "17/09/2025",
    "date_relative": "a month ago",
    "review_text": "A nice variety of curry noodles, with flavors that are rich and satisfying; although a little on the salty side after finishing the meal. A must-try here is the Thai-style omelet, very juicy, flavorful, and generously filled with pork! Indoor air-conditioned seating is limited, so it can be a bit hard to get a comfortable spot during busy hours. Overall, it’s a good place to experience authentic local curry noodles in Chiang Mai.",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdVJVMVpNV2RmYjA0MGRVSlJNMFJvZFVkSlpuYxAB",
    "author_name": "Jeffrey Ness2021",
    "author_url": "https://www.google.com/maps/contrib/116407532466842251410/reviews?hl=en",
    "rating": 5,
    "date_formatted": "31/08/2025",
    "date_relative": "2 months ago",
    "review_text": "This restaurant deserves to get its first Michelin star! All the products were not only very tasty, but the products also contained a unique blend of Norhern Thai-style flavors (which are in my opinion the better dishes of Thailand). We felt really treated like kings. The service was impeccable and no waiting thanks to the digital bell on our dining table. As a starter, we ate the soft, creamy and scrumptious eggplant salad, which I can really recommend to vegetarians. Also the chicken skewers with satay sauce was a great addition to our order, with a wink to the original chicken-satay skewers from Indonesia. Even the pickled veggies let me think of the Indonesian dishes for a while. However, I have to confess that I personally prefer an Indonesian-style satay sauce. For our main course we had a great stir-fried chicken dish with a great combination of spices. To add more spice to our dinner, we had the delicious Kang Nor curry dish. I really like this curry for the added bamboo sprouts and dried fish. As a non-pork eater, I obviously chose this fish-variety. However, they also have a pork-variety. My boyfriend and I were seated inside. The restaurant was well climatized and very clean. You could even look through the glass, where you could see the diligent people working hard to make exquisite dishes. Even the dining tables were of another kind of level. At the end of our dinner we realized that we had been sitting on a ‘remade’ authentic sewing table. It gives the restaurant so much more atmosphere. As a dessert, I ate colored soft noodles in sweet coconut milk. I must say that this type of dessert, has it all to me. We went to our hotel totally satisfied, joyful and fully fed. I can assure everyone that you will enjoy your meal here to the highest level!",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTWQxbFNSemgwVEVsb2FGRXROUzFzVTJSYWVVRRAB",
    "author_name": "Alexia Wu",
    "author_url": "https://www.google.com/maps/contrib/115920220522093664289/reviews?hl=en",
    "rating": 5,
    "date_formatted": "28/10/2025",
    "date_relative": "a week ago",
    "review_text": "Best satay chicken and dessert in town. We also ordered 2 koh soi and were really tasty. The place can get a bit crowded cuz apparently it is a highly recommended place. So be prepared to wait a bit if you come for dinner. But definitely worth visiting!",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUFNtSnJWV2hRTlVNNWJIQm9abTVrZVVOM1JWRRAB",
    "author_name": "Fabien G.",
    "author_url": "https://www.google.com/maps/contrib/103950402934750199113/reviews?hl=en",
    "rating": 1,
    "date_formatted": "20/07/2025",
    "date_relative": "3 months ago",
    "review_text": "What can I say... I think there is a management problem in this restaurant. After being seated, we had to call someone after 15 minutes because no one seemed to want to take our order. No hello. The staff waits for orders with their arms behind their backs against trees or walls. We chose to try the kao soy because we know it well. What a surprise when the dish arrived, we would have said half a portion with say 5 tablespoons of sauce maximum. Also, we decided to try a dessert. Likewise, no one came to ask us if we wanted something... yet many staff were available and we had to call them. And as you can see from the pictures, no one cleared the meal / table before and during dessert. There are other places much better in terms of taste, service and price in Chang Mai.",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5U1NtVnliWGxzZEZWQlF6VklXalExY1VVNFdGRRAB",
    "author_name": "Marcus Nguyen",
    "author_url": "https://www.google.com/maps/contrib/101665156824263661087/reviews?hl=en",
    "rating": 5,
    "date_formatted": "15/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Must eat for anyone wanting to taste authentic northern Thai cuisines. Their Khao soy is rich and creamy, perfectly balanced between coconut milk and spices. Definitely a go to spots for Khao soy lovers in Chiang Mai.",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNlRWVlBOQzFYV1VsSk1FRjNXbVZLYlhkQ2MzYxAB",
    "author_name": "Burcu Güvenatam",
    "author_url": "https://www.google.com/maps/contrib/109426111080051673835/reviews?hl=en",
    "rating": 5,
    "date_formatted": "25/09/2025",
    "date_relative": "a month ago",
    "review_text": "We loved the food! Kao soy with beef was sooo delicious! l loved the aubergine salad and chicken satay was also good with its sauces. Service is very quick also… Lovely place!",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcGNFUldNVWcxVVVKaFRGbFdlbXA0YW5oTVJYYxAB",
    "author_name": "Frank van den Brink",
    "author_url": "https://www.google.com/maps/contrib/109196633285157297039/reviews?hl=en",
    "rating": 5,
    "date_formatted": "22/06/2025",
    "date_relative": "4 months ago",
    "review_text": "Great place for gourmet noodles. Off course a hype because it is Michelin recommended, but the dishes are really good and very moderate priced. The staff seems to be less happy with all the attention and refrain from any smile...",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVmJtcEpNRU00TjJ0bFdVbERUWGc0WW5KTldIYxAB",
    "author_name": "vickie w",
    "author_url": "https://www.google.com/maps/contrib/105524925208508571693/reviews?hl=en",
    "rating": 2,
    "date_formatted": "05/11/2025",
    "date_relative": "4 days ago",
    "review_text": "Tourist trap with inflated prices and bland food. We ordered three different khao sois and a variety of sides and the noodles were overcooked and the food was lukewarm. Also because of the outdoor location and standing water, the restaurant is a breeding ground for mosquitoes that will attack you relentlessly 😭",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNFRUaEtXVmhJZGxJeU9FSTNOR2d0ZVZaSmNrRRAB",
    "author_name": "Sonny",
    "author_url": "https://www.google.com/maps/contrib/107436983641780303813/reviews?hl=en",
    "rating": 5,
    "date_formatted": "09/06/2025",
    "date_relative": "5 months ago",
    "review_text": "Absolutely delicious kao soi! I have tried some other places before but they were so spicy. This place could make \"less spicy\" for me and it was heavenly. I finished the meal in 10 min. Very tender braised beef. Flavorful soup. Crispy and soft noodles. I will come back to here anytime I get to visit Chiang Mai again. It's that good.",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVkxUaFpVakpLWm5Cc1FVWklORE53YW14ZlRtYxAB",
    "author_name": "Tang-Fei Chang",
    "author_url": "https://www.google.com/maps/contrib/114657543380005456650/reviews?hl=en",
    "rating": 4,
    "date_formatted": "20/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Almost every tourist comes here to eat. The prices are a bit higher than other Northern Thai places. The decor and vibe are really nice. The Khao Soi is pretty spicy, and the other dishes are quite strong in flavor too. Worth a try if you’re around, but if there’s a long line, you can skip it.",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUVNFMVVVR0pFVjFGeE5FdExSbUpmTURGVVJuYxAB",
    "author_name": "Jason",
    "author_url": "https://www.google.com/maps/contrib/111872116513476028322/reviews?hl=en",
    "rating": 4,
    "date_formatted": "26/06/2025",
    "date_relative": "4 months ago",
    "review_text": "1350 for 3 different Kao soy, 2 mixed platters and calamari. Everything was nice enough except the calamari. Kao soy was like a Malaysian curry mee (not laksa) with a thicker and plainer broth. The noodles and crunch is nice though. The silkworms were nice and crispy with a bit of salt flavour. Northern Thai sausage platter was average in textures and taste but the dips made up for it. The chicken satay was nice enough but nothing special. The black rice is like a Bak chang so not a fan. Pork floss and onion ring were quite nice. Pork rind was normal. Calamari batter was not sticking and while crispy lacked flavour. Service was a bit slow when getting the bill. Had to ask 3 different people before we got the bill.",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNGNFZFJhVmRGWXpCTkxWTmpWVXB6ZEhGNVpuYxAB",
    "author_name": "Lam Mai",
    "author_url": "https://www.google.com/maps/contrib/105303743975265590045/reviews?hl=en",
    "rating": 5,
    "date_formatted": "06/08/2025",
    "date_relative": "3 months ago",
    "review_text": "Food: 10/10 Atmosphere: 8/10 The best noodle you can find in Chiang Mai. Amazing side dishes too. The restaurant is big, but always crowded so you may have to wait for tables. But it’s totally worth it in my opinion.",
    "page_number": 3,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSVJXdFFSRUZ4Y2xOWk5tcDVaRTkzZGxkblgwRRAB",
    "author_name": "Mr Manders",
    "author_url": "https://www.google.com/maps/contrib/108296664847784626441/reviews?hl=en",
    "rating": 5,
    "date_formatted": "19/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Nice experience with an even better taste. Some seem to disagree but I couldn't see why. Press the button on your table and the staff is there within seconds to help you with anything you'd need. The chicken sate came with one of the best sauce I have ever tasted. The pork egg rolls were yummy and the Kao Soy was spicy and delicious. The drinks are good too, definitely worth a try!",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMWQxbHdTRVpQTkZCa1VtaGZTbVpITnpsNlduYxAB",
    "author_name": "Andrew V",
    "author_url": "https://www.google.com/maps/contrib/106025776551110021136/reviews?hl=en",
    "rating": 5,
    "date_formatted": "26/10/2025",
    "date_relative": "2 weeks ago",
    "review_text": "This isn't my first time here at Kao Soy Nimman but it is my first time dropping the review. I've tried Kao soy from so many places around Chiang Mai, but honestly, Kao Soy Nimman is the best one yet. I get why it’s so famous...and now I 100% agree with all the hype 👍 The broth is rich, creamy, not too thick or liquidly and it's full of flavor, the noodles are perfectly cooked, and that crispy topping adds the perfect crunch. Everything just comes together so well. **Don't underestimate their chilli** Even though it’s already super popular with both locals and tourists, it really deserves the extra fame. If you’re in Chiang Mai and want to taste the best Kao Soy OR Khao Soi, this is the spot. Totally recommend! 👍",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Vk4zaHZkbVZaVTFkNk1reHNMVFJoZERBdFpIYxAB",
    "author_name": "Luana Bedin",
    "author_url": "https://www.google.com/maps/contrib/110803425534899526367/reviews?hl=en",
    "rating": 4,
    "date_formatted": "04/11/2025",
    "date_relative": "6 days ago",
    "review_text": "It's a very famous restaurant in the area, known for the dish that gives the place its name. Because of its fame, it's almost always crowded, so it's common to find a small queue at the entrance.Luckily, the line moved quickly, and we didn't wait long to be seated. The service was good and attentive. We tried the famous Khao Soi: it was tasty, and the ingredients seemed high-quality, but honestly, it wasn't excellent. Given the restaurant's reputation, I was expecting a bit more. It's good, but not the best I've had. They accept card payments.",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SelJuRXdVMEpVYTFKVU1ubFVRMlp5VlVaSlNGRRAB",
    "author_name": "Tates Napawan (Tates)",
    "author_url": "https://www.google.com/maps/contrib/104051659724326102869/reviews?hl=en",
    "rating": 5,
    "date_formatted": "18/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Tried the Khao Soi Chicken and the Chicken Satay Peanut Sauce Noodle both were amazing. The Khao Soi had rich standard coconut curry broth, crispy noodles on top, and super tender chicken. The balance of spice, creaminess, and a squeeze of lime was just perfect. The Satay Peanut Noodles were such a nice surprise!!!! creamy, nutty, slightly sweet, with grilled chicken that had that smoky flavor 9/10. A great fusion of comfort food and Thai street style. Nice cozy spot with warm Chiang Mai vibes. Perfect for anyone who loves flavorful northern Thai food. Highly recommend adding this place to your food list when you’re in town! Food looks as good as it tastes check the photos that I took here.",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa2MxZ3RXV0pUTFZKblVrbFVZek0yZVhKNFZsRRAB",
    "author_name": "Eric Shao",
    "author_url": "https://www.google.com/maps/contrib/118345644082188813951/reviews?hl=en",
    "rating": 3,
    "date_formatted": "05/11/2025",
    "date_relative": "5 days ago",
    "review_text": "I had Oder Chicken Satay,Ong Pu(Crab) , Beef KHAO Soi , Iced Dessert . Actually, I think the KHAO SoI weren't as good as I expected; everyone has their own preferences. I am more like to eat that noodle I’m tried at Chiang Rai. KHAO Soi 4 Stars Iced Dessert 5 Stars!!!! Chicken Satay 3 Stars Ong Pu 1 Stars (This is not something I would eat.) Staff Service Good & Helpful",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V2RVRjJkVXg0TWsxek1rMUlNVGhZY2xwck9WRRAB",
    "author_name": "Adeline Ng",
    "author_url": "https://www.google.com/maps/contrib/107283999270766591412/reviews?hl=en",
    "rating": 5,
    "date_formatted": "28/09/2025",
    "date_relative": "a month ago",
    "review_text": "The KaoSoi (Chiang Mai curry-like noodle ) here is one notch higher and premium quality and more varieties with other stir fried dishes which are equally good. It’s more like a restaurant rather than a noodle bistro. The food are pretty good and yummy, I gave it almost 10pts . A bit on a touristy and pricey side but is worth it. Nicely decorated, clean and staffs able to speak English.",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscmFUVXpXbU13TW1sWFgzb3hRMEpmYlV0aVNrRRAB",
    "author_name": "MonZterella Lee",
    "author_url": "https://www.google.com/maps/contrib/113445967644793914496/reviews?hl=en",
    "rating": 4,
    "date_formatted": "01/11/2025",
    "date_relative": "a week ago",
    "review_text": "Had to try Khao Soi Nimman because our driver recommended it—and it’s super close to our hotel! If you come to Northern Thailand and don’t try Khao Soi, it’s like you didn’t really make it here. We went for chicken Khao Soi, braised beef Khao Soi, stir-fried pumpkin leaves with oyster sauce, crispy ruby dessert in coconut milk, and fresh coconut water. Absolute must-try!",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTlFuWjJaREJhUlhkQ1VHUnRWRGh2Ym14RFMxRRAB",
    "author_name": "Masaaki S",
    "author_url": "https://www.google.com/maps/contrib/105525919671933456837/reviews?hl=en",
    "rating": 5,
    "date_formatted": "30/08/2025",
    "date_relative": "2 months ago",
    "review_text": "The best Kao Soy I’ve ever had. The spiciness of the soup was perfectly balanced—neither overpowering nor too mild. Its consistency struck the right note as well, being neither too thick nor too watery. The two types of noodles, one firm and the other soft, added depth and variety to each bite. Midway through, the topping of lemon slices, onions, and pickled vegetables refreshed the flavor, making the bowl enjoyable from start to finish. Although about ten people were waiting outside, our turn came in just around 20 minutes.",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toYVNscFpOR2xhY1drMFdFNW5ha2t0TWxZd1YxRRAB",
    "author_name": "peteryuchen",
    "author_url": "https://www.google.com/maps/contrib/111345023743504920382/reviews?hl=en",
    "rating": 4,
    "date_formatted": "17/09/2025",
    "date_relative": "a month ago",
    "review_text": "A nice variety of curry noodles, with flavors that are rich and satisfying; although a little on the salty side after finishing the meal. A must-try here is the Thai-style omelet, very juicy, flavorful, and generously filled with pork! Indoor air-conditioned seating is limited, so it can be a bit hard to get a comfortable spot during busy hours. Overall, it’s a good place to experience authentic local curry noodles in Chiang Mai.",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdVJVMVpNV2RmYjA0MGRVSlJNMFJvZFVkSlpuYxAB",
    "author_name": "Jeffrey Ness2021",
    "author_url": "https://www.google.com/maps/contrib/116407532466842251410/reviews?hl=en",
    "rating": 5,
    "date_formatted": "31/08/2025",
    "date_relative": "2 months ago",
    "review_text": "This restaurant deserves to get its first Michelin star! All the products were not only very tasty, but the products also contained a unique blend of Norhern Thai-style flavors (which are in my opinion the better dishes of Thailand). We felt really treated like kings. The service was impeccable and no waiting thanks to the digital bell on our dining table. As a starter, we ate the soft, creamy and scrumptious eggplant salad, which I can really recommend to vegetarians. Also the chicken skewers with satay sauce was a great addition to our order, with a wink to the original chicken-satay skewers from Indonesia. Even the pickled veggies let me think of the Indonesian dishes for a while. However, I have to confess that I personally prefer an Indonesian-style satay sauce. For our main course we had a great stir-fried chicken dish with a great combination of spices. To add more spice to our dinner, we had the delicious Kang Nor curry dish. I really like this curry for the added bamboo sprouts and dried fish. As a non-pork eater, I obviously chose this fish-variety. However, they also have a pork-variety. My boyfriend and I were seated inside. The restaurant was well climatized and very clean. You could even look through the glass, where you could see the diligent people working hard to make exquisite dishes. Even the dining tables were of another kind of level. At the end of our dinner we realized that we had been sitting on a ‘remade’ authentic sewing table. It gives the restaurant so much more atmosphere. As a dessert, I ate colored soft noodles in sweet coconut milk. I must say that this type of dessert, has it all to me. We went to our hotel totally satisfied, joyful and fully fed. I can assure everyone that you will enjoy your meal here to the highest level!",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTWQxbFNSemgwVEVsb2FGRXROUzFzVTJSYWVVRRAB",
    "author_name": "Alexia Wu",
    "author_url": "https://www.google.com/maps/contrib/115920220522093664289/reviews?hl=en",
    "rating": 5,
    "date_formatted": "28/10/2025",
    "date_relative": "a week ago",
    "review_text": "Best satay chicken and dessert in town. We also ordered 2 koh soi and were really tasty. The place can get a bit crowded cuz apparently it is a highly recommended place. So be prepared to wait a bit if you come for dinner. But definitely worth visiting!",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUFNtSnJWV2hRTlVNNWJIQm9abTVrZVVOM1JWRRAB",
    "author_name": "Fabien G.",
    "author_url": "https://www.google.com/maps/contrib/103950402934750199113/reviews?hl=en",
    "rating": 1,
    "date_formatted": "20/07/2025",
    "date_relative": "3 months ago",
    "review_text": "What can I say... I think there is a management problem in this restaurant. After being seated, we had to call someone after 15 minutes because no one seemed to want to take our order. No hello. The staff waits for orders with their arms behind their backs against trees or walls. We chose to try the kao soy because we know it well. What a surprise when the dish arrived, we would have said half a portion with say 5 tablespoons of sauce maximum. Also, we decided to try a dessert. Likewise, no one came to ask us if we wanted something... yet many staff were available and we had to call them. And as you can see from the pictures, no one cleared the meal / table before and during dessert. There are other places much better in terms of taste, service and price in Chang Mai.",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5U1NtVnliWGxzZEZWQlF6VklXalExY1VVNFdGRRAB",
    "author_name": "Marcus Nguyen",
    "author_url": "https://www.google.com/maps/contrib/101665156824263661087/reviews?hl=en",
    "rating": 5,
    "date_formatted": "15/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Must eat for anyone wanting to taste authentic northern Thai cuisines. Their Khao soy is rich and creamy, perfectly balanced between coconut milk and spices. Definitely a go to spots for Khao soy lovers in Chiang Mai.",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNlRWVlBOQzFYV1VsSk1FRjNXbVZLYlhkQ2MzYxAB",
    "author_name": "Burcu Güvenatam",
    "author_url": "https://www.google.com/maps/contrib/109426111080051673835/reviews?hl=en",
    "rating": 5,
    "date_formatted": "25/09/2025",
    "date_relative": "a month ago",
    "review_text": "We loved the food! Kao soy with beef was sooo delicious! l loved the aubergine salad and chicken satay was also good with its sauces. Service is very quick also… Lovely place!",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcGNFUldNVWcxVVVKaFRGbFdlbXA0YW5oTVJYYxAB",
    "author_name": "Frank van den Brink",
    "author_url": "https://www.google.com/maps/contrib/109196633285157297039/reviews?hl=en",
    "rating": 5,
    "date_formatted": "22/06/2025",
    "date_relative": "4 months ago",
    "review_text": "Great place for gourmet noodles. Off course a hype because it is Michelin recommended, but the dishes are really good and very moderate priced. The staff seems to be less happy with all the attention and refrain from any smile...",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVmJtcEpNRU00TjJ0bFdVbERUWGc0WW5KTldIYxAB",
    "author_name": "vickie w",
    "author_url": "https://www.google.com/maps/contrib/105524925208508571693/reviews?hl=en",
    "rating": 2,
    "date_formatted": "05/11/2025",
    "date_relative": "4 days ago",
    "review_text": "Tourist trap with inflated prices and bland food. We ordered three different khao sois and a variety of sides and the noodles were overcooked and the food was lukewarm. Also because of the outdoor location and standing water, the restaurant is a breeding ground for mosquitoes that will attack you relentlessly 😭",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNFRUaEtXVmhJZGxJeU9FSTNOR2d0ZVZaSmNrRRAB",
    "author_name": "Sonny",
    "author_url": "https://www.google.com/maps/contrib/107436983641780303813/reviews?hl=en",
    "rating": 5,
    "date_formatted": "09/06/2025",
    "date_relative": "5 months ago",
    "review_text": "Absolutely delicious kao soi! I have tried some other places before but they were so spicy. This place could make \"less spicy\" for me and it was heavenly. I finished the meal in 10 min. Very tender braised beef. Flavorful soup. Crispy and soft noodles. I will come back to here anytime I get to visit Chiang Mai again. It's that good.",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVkxUaFpVakpLWm5Cc1FVWklORE53YW14ZlRtYxAB",
    "author_name": "Tang-Fei Chang",
    "author_url": "https://www.google.com/maps/contrib/114657543380005456650/reviews?hl=en",
    "rating": 4,
    "date_formatted": "20/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Almost every tourist comes here to eat. The prices are a bit higher than other Northern Thai places. The decor and vibe are really nice. The Khao Soi is pretty spicy, and the other dishes are quite strong in flavor too. Worth a try if you’re around, but if there’s a long line, you can skip it.",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUVNFMVVVR0pFVjFGeE5FdExSbUpmTURGVVJuYxAB",
    "author_name": "Jason",
    "author_url": "https://www.google.com/maps/contrib/111872116513476028322/reviews?hl=en",
    "rating": 4,
    "date_formatted": "26/06/2025",
    "date_relative": "4 months ago",
    "review_text": "1350 for 3 different Kao soy, 2 mixed platters and calamari. Everything was nice enough except the calamari. Kao soy was like a Malaysian curry mee (not laksa) with a thicker and plainer broth. The noodles and crunch is nice though. The silkworms were nice and crispy with a bit of salt flavour. Northern Thai sausage platter was average in textures and taste but the dips made up for it. The chicken satay was nice enough but nothing special. The black rice is like a Bak chang so not a fan. Pork floss and onion ring were quite nice. Pork rind was normal. Calamari batter was not sticking and while crispy lacked flavour. Service was a bit slow when getting the bill. Had to ask 3 different people before we got the bill.",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNGNFZFJhVmRGWXpCTkxWTmpWVXB6ZEhGNVpuYxAB",
    "author_name": "Lam Mai",
    "author_url": "https://www.google.com/maps/contrib/105303743975265590045/reviews?hl=en",
    "rating": 5,
    "date_formatted": "06/08/2025",
    "date_relative": "3 months ago",
    "review_text": "Food: 10/10 Atmosphere: 8/10 The best noodle you can find in Chiang Mai. Amazing side dishes too. The restaurant is big, but always crowded so you may have to wait for tables. But it’s totally worth it in my opinion.",
    "page_number": 4,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSVJXdFFSRUZ4Y2xOWk5tcDVaRTkzZGxkblgwRRAB",
    "author_name": "Mr Manders",
    "author_url": "https://www.google.com/maps/contrib/108296664847784626441/reviews?hl=en",
    "rating": 5,
    "date_formatted": "19/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Nice experience with an even better taste. Some seem to disagree but I couldn't see why. Press the button on your table and the staff is there within seconds to help you with anything you'd need. The chicken sate came with one of the best sauce I have ever tasted. The pork egg rolls were yummy and the Kao Soy was spicy and delicious. The drinks are good too, definitely worth a try!",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMWQxbHdTRVpQTkZCa1VtaGZTbVpITnpsNlduYxAB",
    "author_name": "Andrew V",
    "author_url": "https://www.google.com/maps/contrib/106025776551110021136/reviews?hl=en",
    "rating": 5,
    "date_formatted": "26/10/2025",
    "date_relative": "2 weeks ago",
    "review_text": "This isn't my first time here at Kao Soy Nimman but it is my first time dropping the review. I've tried Kao soy from so many places around Chiang Mai, but honestly, Kao Soy Nimman is the best one yet. I get why it’s so famous...and now I 100% agree with all the hype 👍 The broth is rich, creamy, not too thick or liquidly and it's full of flavor, the noodles are perfectly cooked, and that crispy topping adds the perfect crunch. Everything just comes together so well. **Don't underestimate their chilli** Even though it’s already super popular with both locals and tourists, it really deserves the extra fame. If you’re in Chiang Mai and want to taste the best Kao Soy OR Khao Soi, this is the spot. Totally recommend! 👍",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Vk4zaHZkbVZaVTFkNk1reHNMVFJoZERBdFpIYxAB",
    "author_name": "Luana Bedin",
    "author_url": "https://www.google.com/maps/contrib/110803425534899526367/reviews?hl=en",
    "rating": 4,
    "date_formatted": "04/11/2025",
    "date_relative": "6 days ago",
    "review_text": "It's a very famous restaurant in the area, known for the dish that gives the place its name. Because of its fame, it's almost always crowded, so it's common to find a small queue at the entrance.Luckily, the line moved quickly, and we didn't wait long to be seated. The service was good and attentive. We tried the famous Khao Soi: it was tasty, and the ingredients seemed high-quality, but honestly, it wasn't excellent. Given the restaurant's reputation, I was expecting a bit more. It's good, but not the best I've had. They accept card payments.",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SelJuRXdVMEpVYTFKVU1ubFVRMlp5VlVaSlNGRRAB",
    "author_name": "Tates Napawan (Tates)",
    "author_url": "https://www.google.com/maps/contrib/104051659724326102869/reviews?hl=en",
    "rating": 5,
    "date_formatted": "18/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Tried the Khao Soi Chicken and the Chicken Satay Peanut Sauce Noodle both were amazing. The Khao Soi had rich standard coconut curry broth, crispy noodles on top, and super tender chicken. The balance of spice, creaminess, and a squeeze of lime was just perfect. The Satay Peanut Noodles were such a nice surprise!!!! creamy, nutty, slightly sweet, with grilled chicken that had that smoky flavor 9/10. A great fusion of comfort food and Thai street style. Nice cozy spot with warm Chiang Mai vibes. Perfect for anyone who loves flavorful northern Thai food. Highly recommend adding this place to your food list when you’re in town! Food looks as good as it tastes check the photos that I took here.",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa2MxZ3RXV0pUTFZKblVrbFVZek0yZVhKNFZsRRAB",
    "author_name": "Eric Shao",
    "author_url": "https://www.google.com/maps/contrib/118345644082188813951/reviews?hl=en",
    "rating": 3,
    "date_formatted": "05/11/2025",
    "date_relative": "5 days ago",
    "review_text": "I had Oder Chicken Satay,Ong Pu(Crab) , Beef KHAO Soi , Iced Dessert . Actually, I think the KHAO SoI weren't as good as I expected; everyone has their own preferences. I am more like to eat that noodle I’m tried at Chiang Rai. KHAO Soi 4 Stars Iced Dessert 5 Stars!!!! Chicken Satay 3 Stars Ong Pu 1 Stars (This is not something I would eat.) Staff Service Good & Helpful",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V2RVRjJkVXg0TWsxek1rMUlNVGhZY2xwck9WRRAB",
    "author_name": "Adeline Ng",
    "author_url": "https://www.google.com/maps/contrib/107283999270766591412/reviews?hl=en",
    "rating": 5,
    "date_formatted": "28/09/2025",
    "date_relative": "a month ago",
    "review_text": "The KaoSoi (Chiang Mai curry-like noodle ) here is one notch higher and premium quality and more varieties with other stir fried dishes which are equally good. It’s more like a restaurant rather than a noodle bistro. The food are pretty good and yummy, I gave it almost 10pts . A bit on a touristy and pricey side but is worth it. Nicely decorated, clean and staffs able to speak English.",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscmFUVXpXbU13TW1sWFgzb3hRMEpmYlV0aVNrRRAB",
    "author_name": "MonZterella Lee",
    "author_url": "https://www.google.com/maps/contrib/113445967644793914496/reviews?hl=en",
    "rating": 4,
    "date_formatted": "01/11/2025",
    "date_relative": "a week ago",
    "review_text": "Had to try Khao Soi Nimman because our driver recommended it—and it’s super close to our hotel! If you come to Northern Thailand and don’t try Khao Soi, it’s like you didn’t really make it here. We went for chicken Khao Soi, braised beef Khao Soi, stir-fried pumpkin leaves with oyster sauce, crispy ruby dessert in coconut milk, and fresh coconut water. Absolute must-try!",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTlFuWjJaREJhUlhkQ1VHUnRWRGh2Ym14RFMxRRAB",
    "author_name": "Masaaki S",
    "author_url": "https://www.google.com/maps/contrib/105525919671933456837/reviews?hl=en",
    "rating": 5,
    "date_formatted": "30/08/2025",
    "date_relative": "2 months ago",
    "review_text": "The best Kao Soy I’ve ever had. The spiciness of the soup was perfectly balanced—neither overpowering nor too mild. Its consistency struck the right note as well, being neither too thick nor too watery. The two types of noodles, one firm and the other soft, added depth and variety to each bite. Midway through, the topping of lemon slices, onions, and pickled vegetables refreshed the flavor, making the bowl enjoyable from start to finish. Although about ten people were waiting outside, our turn came in just around 20 minutes.",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toYVNscFpOR2xhY1drMFdFNW5ha2t0TWxZd1YxRRAB",
    "author_name": "peteryuchen",
    "author_url": "https://www.google.com/maps/contrib/111345023743504920382/reviews?hl=en",
    "rating": 4,
    "date_formatted": "17/09/2025",
    "date_relative": "a month ago",
    "review_text": "A nice variety of curry noodles, with flavors that are rich and satisfying; although a little on the salty side after finishing the meal. A must-try here is the Thai-style omelet, very juicy, flavorful, and generously filled with pork! Indoor air-conditioned seating is limited, so it can be a bit hard to get a comfortable spot during busy hours. Overall, it’s a good place to experience authentic local curry noodles in Chiang Mai.",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdVJVMVpNV2RmYjA0MGRVSlJNMFJvZFVkSlpuYxAB",
    "author_name": "Jeffrey Ness2021",
    "author_url": "https://www.google.com/maps/contrib/116407532466842251410/reviews?hl=en",
    "rating": 5,
    "date_formatted": "31/08/2025",
    "date_relative": "2 months ago",
    "review_text": "This restaurant deserves to get its first Michelin star! All the products were not only very tasty, but the products also contained a unique blend of Norhern Thai-style flavors (which are in my opinion the better dishes of Thailand). We felt really treated like kings. The service was impeccable and no waiting thanks to the digital bell on our dining table. As a starter, we ate the soft, creamy and scrumptious eggplant salad, which I can really recommend to vegetarians. Also the chicken skewers with satay sauce was a great addition to our order, with a wink to the original chicken-satay skewers from Indonesia. Even the pickled veggies let me think of the Indonesian dishes for a while. However, I have to confess that I personally prefer an Indonesian-style satay sauce. For our main course we had a great stir-fried chicken dish with a great combination of spices. To add more spice to our dinner, we had the delicious Kang Nor curry dish. I really like this curry for the added bamboo sprouts and dried fish. As a non-pork eater, I obviously chose this fish-variety. However, they also have a pork-variety. My boyfriend and I were seated inside. The restaurant was well climatized and very clean. You could even look through the glass, where you could see the diligent people working hard to make exquisite dishes. Even the dining tables were of another kind of level. At the end of our dinner we realized that we had been sitting on a ‘remade’ authentic sewing table. It gives the restaurant so much more atmosphere. As a dessert, I ate colored soft noodles in sweet coconut milk. I must say that this type of dessert, has it all to me. We went to our hotel totally satisfied, joyful and fully fed. I can assure everyone that you will enjoy your meal here to the highest level!",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTWQxbFNSemgwVEVsb2FGRXROUzFzVTJSYWVVRRAB",
    "author_name": "Alexia Wu",
    "author_url": "https://www.google.com/maps/contrib/115920220522093664289/reviews?hl=en",
    "rating": 5,
    "date_formatted": "28/10/2025",
    "date_relative": "a week ago",
    "review_text": "Best satay chicken and dessert in town. We also ordered 2 koh soi and were really tasty. The place can get a bit crowded cuz apparently it is a highly recommended place. So be prepared to wait a bit if you come for dinner. But definitely worth visiting!",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUFNtSnJWV2hRTlVNNWJIQm9abTVrZVVOM1JWRRAB",
    "author_name": "Fabien G.",
    "author_url": "https://www.google.com/maps/contrib/103950402934750199113/reviews?hl=en",
    "rating": 1,
    "date_formatted": "20/07/2025",
    "date_relative": "3 months ago",
    "review_text": "What can I say... I think there is a management problem in this restaurant. After being seated, we had to call someone after 15 minutes because no one seemed to want to take our order. No hello. The staff waits for orders with their arms behind their backs against trees or walls. We chose to try the kao soy because we know it well. What a surprise when the dish arrived, we would have said half a portion with say 5 tablespoons of sauce maximum. Also, we decided to try a dessert. Likewise, no one came to ask us if we wanted something... yet many staff were available and we had to call them. And as you can see from the pictures, no one cleared the meal / table before and during dessert. There are other places much better in terms of taste, service and price in Chang Mai.",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5U1NtVnliWGxzZEZWQlF6VklXalExY1VVNFdGRRAB",
    "author_name": "Marcus Nguyen",
    "author_url": "https://www.google.com/maps/contrib/101665156824263661087/reviews?hl=en",
    "rating": 5,
    "date_formatted": "15/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Must eat for anyone wanting to taste authentic northern Thai cuisines. Their Khao soy is rich and creamy, perfectly balanced between coconut milk and spices. Definitely a go to spots for Khao soy lovers in Chiang Mai.",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNlRWVlBOQzFYV1VsSk1FRjNXbVZLYlhkQ2MzYxAB",
    "author_name": "Burcu Güvenatam",
    "author_url": "https://www.google.com/maps/contrib/109426111080051673835/reviews?hl=en",
    "rating": 5,
    "date_formatted": "25/09/2025",
    "date_relative": "a month ago",
    "review_text": "We loved the food! Kao soy with beef was sooo delicious! l loved the aubergine salad and chicken satay was also good with its sauces. Service is very quick also… Lovely place!",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcGNFUldNVWcxVVVKaFRGbFdlbXA0YW5oTVJYYxAB",
    "author_name": "Frank van den Brink",
    "author_url": "https://www.google.com/maps/contrib/109196633285157297039/reviews?hl=en",
    "rating": 5,
    "date_formatted": "22/06/2025",
    "date_relative": "4 months ago",
    "review_text": "Great place for gourmet noodles. Off course a hype because it is Michelin recommended, but the dishes are really good and very moderate priced. The staff seems to be less happy with all the attention and refrain from any smile...",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVmJtcEpNRU00TjJ0bFdVbERUWGc0WW5KTldIYxAB",
    "author_name": "vickie w",
    "author_url": "https://www.google.com/maps/contrib/105524925208508571693/reviews?hl=en",
    "rating": 2,
    "date_formatted": "05/11/2025",
    "date_relative": "4 days ago",
    "review_text": "Tourist trap with inflated prices and bland food. We ordered three different khao sois and a variety of sides and the noodles were overcooked and the food was lukewarm. Also because of the outdoor location and standing water, the restaurant is a breeding ground for mosquitoes that will attack you relentlessly 😭",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNFRUaEtXVmhJZGxJeU9FSTNOR2d0ZVZaSmNrRRAB",
    "author_name": "Sonny",
    "author_url": "https://www.google.com/maps/contrib/107436983641780303813/reviews?hl=en",
    "rating": 5,
    "date_formatted": "09/06/2025",
    "date_relative": "5 months ago",
    "review_text": "Absolutely delicious kao soi! I have tried some other places before but they were so spicy. This place could make \"less spicy\" for me and it was heavenly. I finished the meal in 10 min. Very tender braised beef. Flavorful soup. Crispy and soft noodles. I will come back to here anytime I get to visit Chiang Mai again. It's that good.",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVkxUaFpVakpLWm5Cc1FVWklORE53YW14ZlRtYxAB",
    "author_name": "Tang-Fei Chang",
    "author_url": "https://www.google.com/maps/contrib/114657543380005456650/reviews?hl=en",
    "rating": 4,
    "date_formatted": "20/10/2025",
    "date_relative": "3 weeks ago",
    "review_text": "Almost every tourist comes here to eat. The prices are a bit higher than other Northern Thai places. The decor and vibe are really nice. The Khao Soi is pretty spicy, and the other dishes are quite strong in flavor too. Worth a try if you’re around, but if there’s a long line, you can skip it.",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUVNFMVVVR0pFVjFGeE5FdExSbUpmTURGVVJuYxAB",
    "author_name": "Jason",
    "author_url": "https://www.google.com/maps/contrib/111872116513476028322/reviews?hl=en",
    "rating": 4,
    "date_formatted": "26/06/2025",
    "date_relative": "4 months ago",
    "review_text": "1350 for 3 different Kao soy, 2 mixed platters and calamari. Everything was nice enough except the calamari. Kao soy was like a Malaysian curry mee (not laksa) with a thicker and plainer broth. The noodles and crunch is nice though. The silkworms were nice and crispy with a bit of salt flavour. Northern Thai sausage platter was average in textures and taste but the dips made up for it. The chicken satay was nice enough but nothing special. The black rice is like a Bak chang so not a fan. Pork floss and onion ring were quite nice. Pork rind was normal. Calamari batter was not sticking and while crispy lacked flavour. Service was a bit slow when getting the bill. Had to ask 3 different people before we got the bill.",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  },
  {
    "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNGNFZFJhVmRGWXpCTkxWTmpWVXB6ZEhGNVpuYxAB",
    "author_name": "Lam Mai",
    "author_url": "https://www.google.com/maps/contrib/105303743975265590045/reviews?hl=en",
    "rating": 5,
    "date_formatted": "06/08/2025",
    "date_relative": "3 months ago",
    "review_text": "Food: 10/10 Atmosphere: 8/10 The best noodle you can find in Chiang Mai. Amazing side dishes too. The restaurant is big, but always crowded so you may have to wait for tables. But it’s totally worth it in my opinion.",
    "page_number": 5,
    "place_id": "0x30da3a89dde356f5:0xa8e9df0a32571ee1",
    "place_name": "ข้าวซอยนิมมาน"
  }
]